nc: 6
scales:
  l: [1.00, 1.00, 1024]
backbone:
  - [-1, 1, Conv, [16, 3, 2, None, 1, 1, False]]
  - [-1, 1, GhostBottleneck, [16, 3, 1, 1, False, 'RE']]
  - [-1, 1, GhostBottleneck, [24, 3, 2, 4, False, 'RE']]
  - [-1, 1, GhostBottleneck, [24, 3, 1, 3, False, 'RE']]
  - [-1, 1, GhostBottleneck, [40, 5, 2, 3, True, 'RE']]
  - [-1, 1, GhostBottleneck, [40, 5, 1, 3, True, 'RE']]
  - [-1, 1, GhostBottleneck, [40, 5, 1, 3, True, 'RE']]
  - [-1, 1, GhostBottleneck, [80, 3, 2, 6, False, 'HS']]
  - [-1, 1, GhostBottleneck, [80, 3, 1, 2.5, False, 'HS']]
  - [-1, 1, GhostBottleneck, [80, 3, 1, 2.3, False, 'HS']]
  - [-1, 1, GhostBottleneck, [80, 3, 1, 2.3, False, 'HS']]
  - [-1, 1, GhostBottleneck, [112, 3, 1, 6, True, 'HS']]
  - [-1, 1, GhostBottleneck, [112, 3, 1, 6, True, 'HS']]
  - [-1, 1, GhostBottleneck, [160, 5, 2, 6, True, 'HS']]
  - [-1, 1, GhostBottleneck, [160, 5, 1, 6, True, 'HS']]
  - [-1, 1, GhostBottleneck, [160, 5, 1, 6, True, 'HS']]
head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [12, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 23], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 18], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]
  - [[27, 30, 33], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]